{
    "spots":
    [
        {
            "country": "Portugal",
            "surfline_id": "5842041f4e65fad6a7708e59",
            "spot_name": "matosinhos",
            "latitude": 41.172231,
            "longitude": -8.696455,
            "Swell Direction": 270,
            "Wind": 20,
            "Surf Height": "Waist high to double overhead.",
            "Tide": "All tides",
            "description": "Matosinhos is a long, super flexible stretch of beach sheltered by a long breakwater at the northern end. There are a number of distinct breaks starting with a right point at the breakwater end with the waves generally increaing in size as you move south. In the centre of the beach is a right and left peak, while the southern end hosts a right sandbank and a left point. Its proximity to Porto means it gets crowded when it's good.",
            "Ability Level": "All Abilities",
            "Local Vibe": "Doable",
            "Access": "There are some beach side parking bays on the road, plus a couple of small car parks towards the southern end of the beach."
        },

        {
            "country": "Portugal",
            "surfline_id": "58bdfa7882d034001252e3d8",
            "spot_name": "nazare",
            "latitude": 39.604828505731106,
            "longitude": -9.085586071014404,
            "Swell Direction": 280,
            "Wind": 120,
            "Surf Height": "Overhead to infinity.",
            "Tide": "Works on all tides, but is best on a mid incoming tide.",
            "description": "While surfed sporadically earlier, the world's biggest, baddest, most oversized wedge, Nazaré took center stage in the big wave world after Garrett MacNamara was invited there to \"surf the world's biggest wave\" in 2011. Since then, Nazaré has become a household name, one of Portugal's main coastal tourist attractions, a (former) stop on the Big Wave World Tour, and ground zero for big wave tow surfing. On the days when the offshore canyon isn't focusing huge swells into 80-foot peaks, Nazaré's inside sand bar produces heavy, hollow tubes in sizes that mortals can appreciate (as long as those mortals are barrel-riding experts).",
            "Ability Level": "Advanced",
            "Local Vibe": "Welcoming",
            "Access": "Drive from Lisbon to the town of Nazaré, arrange a jet ski, and access the wave via the harbor. On smaller days, paddle out at Praia do Norte."
        },
        {
            "country": "Portugal",
            "surfline_id": "5dea8356fe21a44513cecc3f",
            "spot_name": "almagreira",
            "latitude": 39.3793198140235,
            "longitude": -9.315097782278372,
            "Swell Direction": 315,
            "Wind": 160,
            "Surf Height": "Waist to head high.",
            "Tide": "All tides - beach can disappear at high.",
            "description": "A wall of crumbly, red sandstone cliffs looks out over this huge expanse of golden sand that stretches from Baleal northeast to the Obidos Lagoon. One of the highlights is Almagreira, home to some consistent banks that work through the tides. Picks up loads of swell so super consistent, but easily blown out. No facilities here - access via piste roads, can be tricky after heavy rains.",
            "Ability Level": "All Abilities",
            "Local Vibe": "Doable",
            "Access": "Accessed via rough piste roads, parking on cliff top, don't leave valuables in the car. Cliff access prone to erosion."
        },
        {
            "country": "Portugal",
            "surfline_id": "58bdf3a70cec4200133464f2",
            "spot_name": "lagide",
            "latitude": 39.374914274508626,
            "longitude": -9.33134,
            "Swell Direction": 315,
            "Wind": 160,
            "Surf Height": "Waist high to overhead.",
            "Tide": "Best low to mid tide.",
            "description": "This long, super-fun left sits in front of the car-park at Lagide and is the first thing you see when you pull up. There's a mellow take off, before it walls up into a reeling top to bottom lefthander that peels and peels over a flat reef. There's a dry hair paddle out around the break. All this adds up to one thing - crowds. The take-off point is tiny and many try to take off deep /on the wrong side of the peak to steal a march on the masses.",
            "Ability Level": "Intermediate - Advanced",
            "Local Vibe": "Doable",
            "Access": "Car park overlooks reef."
        },
        {
            "country": "Portugal",
            "surfline_id": "5842041f4e65fad6a7708bc6",
            "spot_name": "baleal",
            "latitude": 39.37397686060677,
            "longitude": -9.332350968299167,
            "Swell Direction": 291,
            "Wind": 45,
            "Surf Height": "Head-high.",
            "Tide": "Mid to lower tide typically best.",
            "description": "A couple of miles north of Peniche is the sandy little island village of Baleal, a big destination for traveling surfers for more than 20 years -- especially when the reefs around Ericeira are blown out with N or S winds. Baleal is an island, so there's almost always a protected beach. It's no surprise that most of the learn-to-surf camps in Portugal are located here. With the mellow left reefbreak of Lagide just north of town, followed by miles of open beachbreak, you can have a pretty high surfer population density without too many problems. There's even a protected bay south of town with mediocre beachbreak that's sheltered from N winds (and huge swells). You won't find perfection in Baleal -- Supertubos is a couple miles south -- but if you keep one eye out on the shifting sandbanks and the other on the flagpoles, you might be able to score some fine beachbreaks with mellow crowds.",
            "Ability Level": "Beginner",
            "Local Vibe": "Doable",
            "Access": "There's a big parking lot right at Lagide where campers congregate. The beachbreaks north are accessed via a dirt track that runs along the coast."
        },
        {
            "country": "Portugal",
            "surfline_id": "5a1c9e91cbecc0001bb480c8",
            "spot_name": "cantinho-da-baia",
            "latitude": 39.37114062429105,
            "longitude": -9.339484170875842,
            "Swell Direction": 325,
            "Wind": 90,
            "Surf Height": "Waist high to overhead.",
            "Tide": "All tides - there is a small section of high tide rocks north of cafe.",
            "description": "Praia do Baleal is a fantastically flexible, crescent shaped beach that curves towards the town. Cantinho Da Baia - 'corner of the bay' is an area that comes to life in a big northerly, or medium sized northwesterly swell and offers clean waves and winds from northeast to southeast direction. Long, sometimes hollow rights can peel here. Consistent and fun, popular with beginners when small.",
            "Ability Level": "All Abilities",
            "Local Vibe": "Welcoming",
            "Access": "Parking either by the beachside cafe or in the large car park to the north."
        },
        {
            "country": "Portugal",
            "surfline_id": "5842041f4e65fad6a7708bc3",
            "spot_name": "supertubos",
            "latitude": 39.34167968424256,
            "longitude": -9.363305611972649,
            "Swell Direction": 289,
            "Wind": 60,
            "Surf Height": "Head-high to double overhead.",
            "Tide": "Mid to high typically best.",
            "description": "Supertubos is one of the best waves in Europe. There's one main peak with a super-fast (though makeable) left, and a somewhat shorter right, and one other peak down the beach that's not quite as perfect but still way better than your average day at most beachbreaks.",
            "Ability Level": "Intermediate - Advanced",
            "Local Vibe": "Doable",
            "Access": "Parking lot right there."
        }
    ]
}
